<div id="about">
<p><a href="zombietower.png"><img src="zombietowert.png" alt="Gestapelte Zombies und Skelette mit R&uuml;stung" align="left" border="0"></a>
<b>Erzeugen (Summon)</b><br>Dieser Generator von /summon Befehlen erm&ouml;glicht es Dir, Mobs aufeinander zu stapeln. Du kannst die Mobs mit bis zu 5 Gegenst&auml;nden ausr&uuml;sten und die Drop-Wahrscheinlichkeit f&uuml;r jeden Gegenstand einzeln definieren. Die meisten Optionen sind spezifisch und gelten nur f&uuml;r den jeweiligen Mob. Au&szlig;erdem k&ouml;nnen Mobs Status(Trank-)Effekte besitzen, welche Du ebenfalls hinzuf&uuml;gen und anpassen kannst. Bewegungseinstellungen k&ouml;nnen auf andere Mobs im Stapel kopiert werden.
</p>
<p>
<b>Spawner</b><br>Anstatt einen Mob zu erzeugen, kannst Du auch einen (benutzerdefinierten) Spawner  erstellen, der die Entities f&uuml;r dich spawnt. 
</p>
<p>
<b>Geben (Give)</b><br>Generiere /give Befehle um Spielern Gegenst&auml;nde zu geben. Der Give Generator verwendet eine vollst&auml;ndige Zielauswahl mit allen m&ouml;glichen Optionen.
</p>
<p>
<b>Gegenstand ersetzen (Entity|Block)</b><br>Der Befehl /replaceitem entity erlaubt es Dir, die Inventare von Mobs und Spielern zu ver&auml;ndern. Auch dieser Generator verwendet eine vollst&auml;ndige Zielauswahl.
</p>
<p>
<b>Gegenst&auml;nde (Items)</b><br>Die Gegenst&auml;nde, die mit Entities gespawnt oder den Spielern gegeben werden haben die meisten Optionen, die Du brauchst. Dazu geh&ouml;ren Verzauberungen, benutzerdefinierte Namen, Untertitel (Beschreibung oder auch Lore genannt), eigene Trankeffekte f&uuml;r Tr&auml;nke, Farben f&uuml;r Lederr&uuml;stung, Attribute wie "CanPlaceOn", "CanDestroy" & Attribute verstecken, eigene Explosionen (f&uuml;r Feuerwerk), Spielerk&ouml;pfe und mehr. Allen Gegenst&auml;nden k&ouml;nnen auch Attribute Modifiers zugewiesen werden.
</p>
<p>
F&auml;hrst Du mit der Maus &uuml;ber die Felder, erscheinen kleine Hilfetexte, die Erkl&auml;rungen zu dem jeweiligen Attribut sind. F&uuml;r die, die's ganz genau wissen wollen: Wof&uuml;r die ganzen Werte und Attribute stehen, besuche bitte die <a href="http://minecraft-de.gamepedia.com/Chunk_Format#Wesen" target="_blank">Minecraft Wiki: Chunk Format</a>.
</p>
<p>
Die generierten Befehle k&ouml;nnen sehr lang sein und daher nicht einfach in die Chatzeile kopiert und von dort aus ausgef&uuml;hrt werden. Um die Befehle dieses Tools zu verwenden ben&ouml;tigst du <a href="http://minecraft-de.gamepedia.com/Befehlsblock" target="_blank">Befehlsbl&ouml;cke</a>.
 Um Befehlsbl&ouml;cke verwenden zu k&ouml;nnen musst Du OP (Operator/Administrator) sein (auf einem Server) oder Cheats aktiviert haben (im Einzelspielermodus). Den Befehlsblock erh&auml;lst Du durch Eingabe dieses Befehls in den Chat: <b>/give @p minecraft:command_block</b> . Au&szlig;erdem musst Du im Kreativmodus sein, um die Befehle kopieren zu k&ouml;nnen. Zum Ausf&uuml;hren des Befehls brauchst Du dann einfach nur noch ein Redstone-Signal (z.B. Redstone-Fackel, Druckplatte, Redstoneblock...)
</p>
<p>
Sei vorsichtig bei der Verwendung dieses Generators. Es kann immer passieren, dass Du Deine Maps zerst&ouml;rst aufgrund Werte au&szlig;erhalb der erwarteten Bereiche oder Werte im falschen Format. Um sicher zu gehen, teste die Befehle vorher auf einer "Einweg-Welt" oder sichere vorher deine Maps. Dieses Tool pr&uuml;ft die Befehle nicht auf Korrektheit! Ansonsten viel Spa&szlig; mit diesem Generator!
</p>
</div>