<h2 class='help'>Hilfe</h2>
<p class='help'>MCStacker erm&ouml;glicht es Dir nun Deine Befehle zu speichern und mit anderen zu teilen. Du kannst mit anderen &uuml;ber einen Befehl diskutieren oder neue Befehle anderer Benutzer suchen und entdecken. Zum Speichern und Kommentieren von Befehlen ben&ouml;tigst Du lediglich einen kostenlosen MCStacker Account.</p>

<h2 class='help'>Ein Konto erstellen</h2>
<p class='help'>Um ein Konto zu erstellen brauchst Du nur auf den "Registrieren"-Button klicken. Ben&ouml;tigt werden zur Anmeldung ein Benutzername, Passwort und eine g&uuml;ltige E-Mail-Adresse. Bevor Du Dich dann anmelden kannst, musst Du deine E-Mail-Adresse best&auml;tigen. Sobald dies erledigt ist, kannst Du Dich jederzeit anmelden.</p>  

<h2 class='help'>Speichere Deine Befehle</h2>
<p class='help'>Nachdem du Einstellungen in irgendeinem der Befehlsgeneratoren vorgenommen hast, kannst Du diese durch Klicken auf "Als neuen Befehl speichern" in deinem Konto sichern. Damit kannst Du nun auch weitere Details zu deinem Befehl angeben. Wenn Du einen Befehl eines anderen Benutzers als neuen Befehl speicherst wird keine Abstammungsbeziehung hergestellt. Dazu aber sp&auml;ter mehr.</p>  

<h3 class='help'>Titel</h3> 
<p class='help'>Gib Deinem Befehl einen aussagekr&auml;ftigen Titel - man sollte direkt erkennen k&ouml;nnen wof&uuml;r er zu gebrauchen ist oder was er macht. Das erleichtert auch anderen deinen Befehl mit der Suche zu finden.</p>  

<h3 class='help'>Beschreibung</h3>
<p class='help'>Hinterlege eine detaillierte Beschreibung &uuml;ber die Funktion deines Befehls, damit andere Benutzer erfahren, was er tut oder f&uuml;r was er zu gebrauchen ist. Mit der Markdown-Syntax kannst Du die Beschreibung mit Fett- und Kursivschrift sowie Unterstreichungen formatieren. Links funktionieren nat&uuml;rlich auch, z.B. wenn der Befehl verwandt mit einem YouTube Video ist oder Du die Profilseite des Erstellers auf einem sozialen Netzwerk verkn&uuml;pfen willst. Diese Funktion darf nicht zum Verlinken von Seiten verwendet werden, die nicht zum Thema passen oder unangemessen in jeglicher Art sind.</p>  

<h3 class='help'>&Ouml;ffentlich</h3>
<p class='help'>Wenn Du Deinen Befehl f&uuml;r Dich behalten willst, dann entferne den Haken bei der Checkbox "&Ouml;ffentlich". Damit erscheint der Befehl nicht in der Suche und andere k&ouml;nnen ihn nicht sehen, auch nicht &uuml;ber den "Teilen"-Link.</p>  

<h3 class='help'>Kommentare erlauben</h3>
<p class='help'>Ist dein Befehl &ouml;ffentlich zug&auml;nglich, kannst Du auch Kommentare erlauben. Andere registrierte Nutzer k&ouml;nnen so deinen Befehl kommentieren und dar&uuml;ber diskutieren. Hat Dein Befehl schon einige Kommentare k&ouml;nnen weitere neue Kommentare blockiert werden, indem du den Haken bei "Kommentare erlauben" entfernst. Die alten Kommentare bleiben dennoch sichtbar, nur sind eben neue Kommentare jetzt nicht mehr m&ouml;glich. Als Ersteller eines Befehls kannst Du Kommentare anderer Benutzer l&ouml;schen, aber nur dann, wenn es sich dabei um unangemessenen Inhalt handelt oder die Unterhaltungen im Wesentlichen nicht komplett zerst&ouml;rt werden ("L&uuml;cken" zwischen Antworten). Klicke auf die M&uuml;lltonne neben einem Kommentar, um diesen zu entfernen. Es gibt auch eine Funktion, die alle Kommentare auf einmal l&ouml;scht. Bitte verwende dies nur, wenn es wirklich notwendig ist, denn andere Benutzer k&ouml;nnten beleidigt sein wenn sie Kommentare verfassen die sowieso gel&ouml;scht werden. Also setze dieses Feature sparsam ein!</p>   

<h3 class='help'>Tags</h3>
<p class='help'>Mit Tags k&ouml;nnen andere Benutzer deinen Befehl mit der Suche finden. Es sind 10 Tags pro Befehl erlaubt.</p>   

<h2 class='help'>Suchen / Entdecken</h2>
<p class='help'>Es gibt viele M&ouml;glichkeiten nach einem Befehl zu suchen. Du kannst nach Befehlstyp, Titel, Beschreibung, Ersteller, Tags und Kommentaren suchen. 10 Suchergebnisse werden je Seite angezeigt, mit einer Begrenzung von max. 40 Seiten (die Seitenzahl befindet sich &uuml;ber den Suchergebnissen). Durch Klicken auf die Spaltentitel kannst Du die Ergebnisse sortieren. Um alle Ergebnisse anzeigen zu lassen musst Du einfach nur das Suchfeld leer lassen. Mit Bool'schen Zeichen kannst Du Deine Suche weiter verfeinern. Ein Plus (+) gibt an, dass das Wort, das nach dem Plus steht in den Suchergebnis vorkommen muss. Umgekehrt verh&auml;lt es sich mit einem Minus (-), das ein Wort von der Suche ausschlie&szlig;t. Mit ( ) Klammern gruppierst du W&ouml;rter in einzelne Suchausdr&uuml;cke. Mit doppelten Anf&uuml;hrungszeichen werden nur Ergebnisse angezeigt, die die Suchphrase als Ganzes genau so enthalten.</p>  

<h2 class='help'>Gef&auml;llt mir!</h2>
<p class='help'>W&auml;hrend Du Befehle von anderen ansiehst k&ouml;nntest Du etwas finden, das dir gef&auml;llt. Dann klicke einfach den Gef&auml;llt mir Button. Dies hat zwei Auswirkungen: Der Befehl wird in Deiner "Gef&auml;llt-mir"-Liste gespeichert, sodass Du den Befehl schneller wiederfindest und der "Gef&auml;llt-mir"-Z&auml;hler des Befehls wird erh&ouml;ht. Befehle mit den meisten Gef&auml;llt mir Angaben werden als erstes angezeigt, wenn man nach der Spalte "Gef&auml;llt mir" sortiert. So k&ouml;nnen andere einen beliebten Befehl leichter finden.</p>  

<h2 class='help'>Befehle kopieren/klonen und Abstammungsbefehle</h2>
<p class='help'>Wenn Du Dir einen Befehl ansiehst (Deinen eigenen oder den eines anderen), kannst du diesen duplizieren. Damit erzeugst Du eine Kopie in deinem Konto und erstellt gleichzeitig eine Abstammungsbeziehung zu dem Original her. Zweck ist die Nennung des Urhebers des Original-Befehls, der interessant, n&uuml;tzlich oder kompliziert ist. Beim Kopieren werden nur der Titel und die Beschreibung &uuml;bernommen, verbundene Tags, Kommentare und Gef&auml;llt mir Angaben werden dagegen nicht geklont. Ab jetzt kannst Du nun &Auml;nderungen am kopierten Befehl vornehmen und speichern. Ein geklonter Befehl verlinkt seine Quelle (Elternteil). Die Abstammungsbeziehung kann aber gel&ouml;scht werden, und zwar auf zwei Wegen: Du kannst die Beziehung l&ouml;schen, die ein Befehl zu seiner Quelle hat ODER du l&ouml;scht die Beziehung eines Befehls zu seinen neueren Kopien (Kindobjekte). Du kannst die Abstammungsbeziehung l&ouml;schen wenn Du in der Meinung bist, dass du den Befehl sehr stark ver&auml;ndert hast und die Beziehung daher nicht mehr l&auml;nger relevant ist. Die Beziehungen zu den Kindobjekten kann dagegen nur der Ersteller eines Befehls entfernen. </p>      

<h2 class='help'>Kommentieren</h2>
<p class='help'>Erlaubt Dir der Befehlsinhaber das Posten von Kommentaren, kannst du gerne einen hinterlassen. Nat&uuml;rlich kannst auch deine eigenen Kommentare l&ouml;schen. Die Markdown-Syntax ist erlaubt und Links zu anderen verwandten Themen k&ouml;nnen im Kommentar gesetzt werden. Bitte halte die Kommentare themenbezogen zu dem Befehl. </p> 

<h2 class='help'>Diskutieren</h2>
<p class='help'>
Der Diskussionsbereich zeigt eine Liste von Befehlen, denen du folgst und die ungelesene Kommentare enthalten. Mit Folgen sind die Befehle gemeint, die Du erstellt, mit "Gef&auml;llt mir" markiert oder kommentiert hast. Die Befehle werden aus der Liste wieder entfernt, sobald Du die Kommentare des Befehls gelesen hast. Dieses Feature vereinfacht die Diskussion &uuml;ber Befehle, die dich interessieren und erspart Dir das Klicken durch viele Befehle auf der Suche nach neuen Kommentaren.</p>

<h2 class='help'>Melden</h2>
<p class='help'>Es kann mal passieren, dass Du einen Befehl findest der eigentlich nicht hier reingeh&ouml;rt, zum Beispiel wenn er fehlerhaft ("buggy") oder anst&ouml;&szlig;ig ist oder Probleme verursacht. Du kannst solche Befehle dann melden und ich schaue dann, was ich machen kann.</p>  
