<span id="leftNews">
  <p>
    <b>
      Das MCStacker Block Commands Update
    </b>
    <br>
    Dieses Update f&uuml;gt neue Generatoren f&uuml;r die Befehle fill, setblock, replaceitem block und blockdata. DataTag Code kann generiert werden f&uuml;r die meisten komplexen Bl&ouml;cke: Dazu geh&ouml;ren Truhen, Befehlsbl&ouml;cke, Schilder, Spieler-/Mobk&ouml;pfe, Mobspawner (mit Spawnwahrscheinlichkeiten) und mehr. Sollte ich etwas Wichtiges vergessen haben, schreib' mich bitte an.
  </p>
  <p>
    Ein weiteres Feature dieses Updates ist der neue Typ 'Any Command' (sonstiger Befehl). Hier kannst Du manuell einen Befehl eingeben und ihn dann speichern. Diese Befehle k&ouml;nnen auf Privat gestellt werden wenn du sie nur f&uuml;r dich behalten willst. Andernfalls, wenn er interessant ist, kannst du ihn auch f&uuml;r die &Ouml;ffentlichkeit freigeben. Mit diesem Typ kannst Du z.B. auch andere Benutzer um Hilfe bitten.
  </p>
  <p>
    
    Viel Spa&szlig; beim Erstellen von coolen Loot-Truhen.
  </p>
  <p>
    <b>
      Das MCStacker Community Update
    </b>
    <br>
    MCStacker startete im Februar 2014 als einfaches Tool zum Aufeinanderstapeln von Mobs. Zu dieser Zeit schien es so, als ob es keine weiteren Onlinegeneratoren g&auml;be, die so etwas machen konnten. Also habe ich einen gemacht. Am Anfang waren die Optionen f&uuml;r spezielle Entities ziemlich eingeschr&auml;nkt. Es w&auml;re wohl dabei geblieben, wenn keiner sich die Zeit genommen h&auml;tte, neue Funktionen per E-Mail anzufragen.
  </p>
  <p>
    Etwa in der Jahresmitte 2014 wurde MCStacker immer beliebter. Das Interesse in diesem Tool steigte und ich bemerkte, dass es immer &ouml;fter in Foren und an anderen Stellen des Webs erw&auml;hnt wurde. Feature-Anfragen und Bug-Meldungen wurden stetig ausgef&uuml;hrt. Weitere Funktionen wurden hinzugef&uuml;gt. Ich stellte mir dann ein System vor, in dem Benutzer ihre Befehle f&uuml;r sp&auml;ter speichern und diese mit anderen teilen konnten. Allein mit dem /Summon Generator konnte man so viele komplexe Entities erzeugen. Mein Ziel war es, MCStacker zu dem Anlaufspunkt f&uuml;r komplizierte Entity-Stapel f&uuml;r Map-Ersteller oder Leute, die einfach nur experimentieren wollten, zu machen. Aber ich h&ouml;rte nicht dort auf. Warum MCStacker nicht in ein Forum verwandeln wo Benutzer Befehle erstellen und &uuml;ber sie diskutieren k&ouml;nnen?
  </p>
  <p>
    Diese Version von MCStacker vereinfacht nun das Speichern, Teilen, Favorisieren, Suchen und Diskutieren von Befehlen. Das Interesse, das dieses Tool bekommt gerechtfertigt die Arbeit, die ich in diese Version hineingesteckt habe. Es war gut, neue Technologien zu lernen und Programmier- und Datenbankwissen anzuwenden, das ich schon eine Weile nicht mehr gebraucht hatte. 
  </p>
  <p>
    Es gibt noch viel zu tun, und solange Minecraft sich entwickelt wird MCStacker es auch tun. Ich plane weitere Verbesserungen hinzuzuf&uuml;gen und habe immer ein offenes Ohr f&uuml;r neue Feature-W&uuml;nsche. Bitte melde mir auftretenede Bugs, falls du welche finden solltest.
  </p>
  <p>
    <b>
      Kontakt
    </b>
    <br>
    Schreibe mir an
    <a href="mailto:bimbimma@gmail.com">
      bimbimma@gmail.com
    </a>
    zum Hinterlassen von Feedback, Verbesserungsw&uuml;nsche, Fehlermeldungen oder was auch immer <b>(denke bitte daran, dass ich kein Deutsch, sondern Englisch spreche!)</b>. Wenn du Fehler meldest hilft mir eine seeehr genaue Angabe &uuml;ber das Problem, das du hast. Wenn MCStacker falsche oder unbrauchbare Befehle ausgibt, sende sie mir bitte damit ich sie aussortieren kann. Nat&uuml;rlich kannst du f&uuml;r gespeicherte Befehle auch das Meldesystem verwenden.
  </p>
  <p>
    <b>
      Die Zukunft
    </b>
    <br>
    Danke an alle, die mich kontaktiert haben um "Danke" zu sagen und sich weitere Features w&uuml;nschen. MCStacker wird nur Vanilla (ungemoddetes) Minecraft unterst&uuml;tzen. Manche Leute haben mich gefragt einen Generator f&uuml;r Plugins und Mods zu erstellen. Leider habe ich daf&uuml;r zu wenig Zeit. 
  </p>
  <p>
    Derzeit arbeite ich daran, die Seite umzubauen, damit sie leichter &uuml;bersetzt werden kann, so wie diese Seite zum Beispiel nun auf Deutsch verf&uuml;gbar ist :-)
	Ich w&uuml;rde mich freuen, wenn es Freiwillige gibt, die helfen wollen, MCStacker in eine andere Sprache zu &uuml;bersetzen.</p>
	<p>Die deutsche Version von MCStacker wurde &uuml;bersetzt von: <a href="http://www.alles-minecraft.de" target="_blank">Alles-Minecraft.de - Deine deutsche Minecraftcommunity</a><br/><u>Keine Haftung f&uuml;r Fehler in der deutschen &Uuml;bersetzung.</u> Verbesserungsvorschl&auml;ge kannst Du gerne im <a href="http://www.alles-minecraft.de/forum/index" title="Deutsches Minecraftforum" target="_blank">Forum</a> posten.</p>
</span>