<p class='help'><b>Allgemeine Verwendungsbedingungen</b><br>
Mit der Registrierung zur Verwendung dieser Seite erkl&auml;rst Du dich mit nachfolgenden Bedingungen einverstanden:</p>
<ul class='help'>
<li>Das mehrfache Duplizieren/Erstellen von identischen Befehlen ist nicht erlaubt.</li>
<li>Schreibe nichts, das andere Nutzer als anst&ouml;&szlig;ig oder unangemessen empfinden k&ouml;nnten. Diese Regel bezieht sich auf Titel, Beschreibungen, Tags und Kommentaren von Befehlen. Ausnahme sind private, nicht &ouml;ffentliche Befehle. Mach' mit diesen was Du willst.</li> 
<li>Solltest Du einen Exploit (Sicherheitsl&uuml;cke) oder Fehler (Bugs) finden, melde diese bitte mit dem Meldesystem oder an bimbimma@gmail.com (bitte auf Englisch!)</li>
<li>Befehle, die l&auml;nger als ein Jahr nicht mehr angesehen wurden k&ouml;nnen gel&ouml;scht werden. Dies dient dem Zweck zur Maximierung des Speicherplatz in der Datenbank. Befehle, die mindestens einmal alle 365 Tage betrachtet werden bleiben erhalten.</li> 
<li>Der Administrator (ich) kann nach eigenem Ermessen bei Missbrauch von MCStacker Benutzerkonten deaktivieren und Befehle samt verbundener Daten l&ouml;schen.</li>  
<li>Es kann sein, dass generierte Befehle von MCStacker Deine Minecraft-Welt/-Karte zerst&ouml;ren, wenn Werte au&szlig;erhalb des erwarteten Bereichs oder in einem ung&uuml;ltigen Format eingegeben worden sind. Ich &uuml;bernehme keine Verantwortung f&uuml;r Befehle, die deine Maps zerst&ouml;ren. Du verwendest die von MCStacker generierten Befehle auf eigene Gefahr.</li>
</ul>
<p class='help'><b>Datenschutzerkl&auml;rung</b><br>
Ich bin extrem vorsichtig mit deinen pers&ouml;nlichen Daten. Ich werde diese Daten niemals an Dritte weitergeben. Auch wenn diese Webseite kein SSL nutzt: Die Passw&ouml;rter werden verschl&uuml;sselt, bevor sie zum Server gesendet werden. Au&szlig;erdem werden Passw&ouml;rter vor dem Speichern in der Datenbank nochmals mit einer robusten Verschl&uuml;sselungsmechanik codiert. Selbst ich werde so nie an dein Passwort kommen. Wenn Dir sichere Passw&ouml;rter wichtig sind, dann nutze am Besten f&uuml;r MCStacker ein Passwort, das du sonst nirgendwo benutzt, auch nicht zum Einloggen in Minecraft. Deine E-Mail wird nur zum Best&auml;tigen, Passwortreset und Kontaktaufnahme gespeichert. Im Moment plane ich keine Newsletter an registrierte Nutzer senden. Sollte dies doch irgendwann mal der Fall sein, wird es eine Opt-Out M&ouml;glichkeit (Abmeldung solcher Emails) geben, um zuk&uuml;nfige E-Mails nicht mehr zu erhalten. </p>
